Revit 2027 API
LogicalAndFilter Constructor
Overload List
Name | Description
LogicalAndFilter(IList<ElementFilter>) |  Constructs a new instance of the logical filter with any number of input filters.
LogicalAndFilter(ElementFilter, ElementFilter) |  Constructs a new instance of the logical filter with two input filters.
Top
See Also
Reference
LogicalAndFilter Class
Autodesk.Revit.DB Namespace